import { ICreatePost } from './types';

export const mockPosts:ICreatePost[] = [
    {
        id: '1290ie1',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie2',
        idAuthor: '12213213d',
        title:"УПА та лісові брати",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Ruda_R%C3%B3%C5%BCaniecka_1945.jpg/440px-Ruda_R%C3%B3%C5%BCaniecka_1945.jpg",
        dataYearFrom:"1928",
        dataYearTo:"1945",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie3',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie4',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie4',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie5',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {id: '1290ie7',
    idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie8',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie9',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290i10',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290i11',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290i12',
        idAuthor: '12213213d',
        title:"Українська повстанська армія",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg/600px-%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B8%D0%B9_%D0%A5%D1%80%D0%B5%D1%81%D1%82_%D0%91%D0%BE%D0%B9%D0%BE%D0%B2%D0%BE%D1%97_%D0%97%D0%B0%D1%81%D0%BB%D1%83%D0%B3%D0%B8_%D0%A3%D0%9F%D0%90.svg.png",
        dataYearFrom:"1942",
        dataYearTo:"1960",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
]

export const mockPeople:ICreatePost[] = [
    {
        id: '1290ie1',
        idAuthor: '12213213d',
        title:"Степан Бандера",
        image:"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/SBandera.jpg/250px-SBandera.jpg",
        dataYearFrom:"1909",
        dataYearTo:"1959",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie3',
        idAuthor: '12213213d',
        title:"Кордюк Богдан",
        image:"https://upload.wikimedia.org/wikipedia/uk/4/48/%D0%91%D0%BE%D0%B3%D0%B4%D0%B0%D0%BD_%D0%9A%D0%BE%D1%80%D0%B4%D1%8E%D0%BA.JPG",
        dataYearFrom:"1910",
        dataYearTo:"1933",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    {
        id: '1290ie3',
        idAuthor: '12213213d',
        title:"Роман Ільницький",
        image:"https://upload.wikimedia.org/wikipedia/uk/b/b2/Ilnytskyj.jpg",
        dataYearFrom:"1957",
        dataYearTo:"1972",
        dataText: [
            {
                type:"text",
                value:"Украї́нська повста́нська а́рмія (УПА́)",
                style: {
                    bold:true,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"— військово-політичне формування, що діяло в Україні протягом 1942—1960 років[4][5](хоча були й випадки бойового спротиву окремих бійців УПА і пізніше[6]), озброєне крило ОУНР[7][8] та загони підпорядковані Уряду УНР[9].",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:false,
                },
            },
            {
                type:"text",
                value:"Перші загони УПА Поліська Січ були сформовані Бульбою-Боровцем 28 червня 1941 року.[9] Члени ОУН якийсь час не підтримували збройну боротьбу з німцями, називаючи партизан агентами Сталіна і Сікорського.[9] Вони розпочали активну діяльність лише з весни 1943 року на територіях, що входили до складу: райхскомісаріату Україна (Генеральна округа Волинь-Поділля) — з кінця березня 1943 року, Генерал-губернаторства (Галичина — з кінця 1943 року, Холмщина — з осені 1943 року) та румунської Трансністрії (Північна Буковина) — з літа 1944 року. Окремі загони також діяли і на території східної України на Донбасі та навіть на Кубані.",
                style:{
                    bold:false,
                    fontSize:"16px",
                    italic:false,
                    newLine:true,
                }
            }
        ]
    },
    
]